tutorials/rhoTurbTwinParcelFoam/simplifiedSiwek/constant/kinematicCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      kinematicCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Particle sub-models
InjectionModel                           ManualInjection;
DragModel                                SphereDrag;
DispersionModel                          StochasticDispersionRAS;
WallInteractionModel                     StandardWallInteraction;

// Parcel basis type
parcelBasisType                          mass;

// Total mass to inject
massTotal  massTotal [ 1  0  0  0  0]    2.0e-4;

// Minimum particle mass
minParticleMass      minParticleMass     [ 1  0  0  0  0]     1.0e-15;

// Parcel thermo properties
rho0      rho0     [ 1 -3  0  0  0]      5000;

// Coupling between particles and carrier phase via source terms
coupled                                  true;

// Integer used to identify different parcel types
parcelTypeId                             2;

interpolationSchemes
{
    rho                                  cell;
    U                                    cellPointFace;
    mu                                   cell;
}

integrationSchemes
{
    U                                    Euler;
}

ManualInjectionCoeffs
{
    SOI                                  0.0;
    positionsFile                        kinematicCloud1Positions;
    U0                                   (0 0 0);
    parcelPDF
    {
        pdfType                          RosinRammler;
        RosinRammlerPDF
        {
            minValue                     50.0e-06;
            maxValue                     100.0e-06;
            d                            (75.0e-06);
            n                            (0.5);
        }
    }
}

ConeInjectionCoeffs
{
    SOI                                  0.001;
    duration                             0.005;
    position                             (0.25 0.25 0.05);
    direction                            (0 -1 0);
    parcelsPerSecond                     10000;
    volumeFlowRate                       Constant;
    volumeFlowRateCoeffs
    {
        value                            0.01;
    }
    Umag                                 Constant;
    UmagCoeffs
    {
        value                            50.0;
    }
    thetaInner                           Constant;
    thetaInnerCoeffs
    {
        value                            0.0;
    }
    thetaOuter                           Constant;
    thetaOuterCoeffs
    {
        value                            30.0;
    }
    parcelPDF
    {
        pdfType                          RosinRammler;
        RosinRammlerPDF
        {
            minValue                     50.0e-06;
            maxValue                     100.0e-06;
            d                            (75.0e-06);
            n                            (0.5);
        }
    }
}

StandardWallInteractionCoeffs
{
    e      e        [ 0  0  0  0  0]     1;
    mu     mu       [ 0  0  0  0  0]     0;
}

// ************************************************************************* //
